;Place localized text in this file
;Use the same localization as the advent shield bearer.
[XComEnergyShield X2AbilityTemplate]
LocFriendlyName="Generate Group Energy Shield"
LocLongDescription="The Shieldbearer can generate an energy shield to protect all nearby allies. The shields will collapse if this unit is killed."
LocHelpText="Project an energy shield around nearby allies and yourself."
LocFlyOverText="Energy Shield"
[XComEnergyShieldPersonal X2AbilityTemplate]
LocFriendlyName="Generate Personal Energy Shield"
LocLongDescription="The Shieldbearer can generate an energy shield to protect himself."
LocHelpText="Project an energy shield around yourself."
LocFlyOverText="Energy Shield"
[XES_EnergyShield X2EquipmentTemplate]
FriendlyName="Group Energy Shield Generator"
FriendlyNamePlural="Group Energy Shield Generators"
;BriefSummary="The Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field. The Energy Shield Generator affects the bearer and nearby allies."
;TacticalText="<Bullet/> The Energy Shield Generator can provide <Ability:ENERGY_SHIELD_HP/>HP to all soldiers in range and line of sight in the form of a temporary shield.\n<Bullet/> The Energy shield will expire either after <Ability:ENERGY_SHIELD_DURATION_TEXT> turns or after absorbing the <Ability:ENERGY_SHIELD_HP/> damage.\n"
BriefSummary="The Group Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field. The Energy Shield Generator affects the bearer and nearby allies."
TacticalText="<Bullet/> The Group Energy Shield Generator can provide a 2HP shield to all soldiers in range and line of sight.\n<Bullet/> The Energy Shield will expire either after 6 turns or after absorbing the full 2 damage.\n"
[XES_EnergyShieldPersonal X2EquipmentTemplate]
FriendlyName="Personal Energy Shield Generator"
FriendlyNamePlural="Personal Energy Shield Generators"
;BriefSummary="The Personal Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's soldiers in the field. The Personal Energy Shield Generator only affects the bearer."
;TacticalText="<Bullet/> The Energy Shield Generator can provide <Ability:ENERGY_SHIELD_HP/>HP to all soldiers in range and line of sight in the form of a temporary shield.\n<Bullet/> The Energy shield will expire either after <Ability:ENERGY_SHIELD_DURATION_TEXT> turns or after absorbing the <Ability:ENERGY_SHIELD_HP/> damage.\n"
BriefSummary="The Personal Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's soldiers in the field. The Personal Energy Shield Generator only affects the bearer."
TacticalText="<Bullet/> The Personal Energy Shield Generator can provide a 4HP shield to its bearer.\n<Bullet/> The Energy Shield will expire either after 6 turns or after absorbing the full 4 damage.\n"
[XES_EnergyShieldHeavy X2WeaponTemplate]
FriendlyName="Group Energy Shield Generator"
FriendlyNamePlural="Group Energy Shield Generators"
;BriefSummary="The Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field. The Energy Shield Generator affects the bearer and nearby allies."
;TacticalText="<Bullet/> The Energy Shield Generator can provide <Ability:ENERGY_SHIELD_HP/>HP to all soldiers in range and line of sight in the form of a temporary shield.\n<Bullet/> The Energy shield will expire either after <Ability:ENERGY_SHIELD_DURATION_TEXT> turns or after absorbing the <Ability:ENERGY_SHIELD_HP/> damage.\n"
BriefSummary="The Group Energy Shield Generator uses Advent Technology recovered from their Shieldbearers to create a weaker but longer lasting version of their protective shields for XCom's squad in the field. The Energy Shield Generator affects the bearer and nearby allies. Because of the immense energy that it must contain, the Group Energy Shield Generator can only be equipped as a heavy weapon."
TacticalText="<Bullet/> The Group Energy Shield Generator is a heavy weapon.\n<Bullet\> It can provide a 2HP shield to all soldiers in range and line of sight.\n<Bullet/> The Energy Shield will expire either after 6 turns or after absorbing the full 2 damage.\n"
[XES_EnergyShieldGrenade X2GrenadeTemplate]
FriendlyName="Energy Shield Grenade"
FriendlyNamePlural="Energy Shield Grenades"
BriefSummary="The Energy Shield Grenade uses Advent Technology recovered from their Shieldbearers to create a grenade capable of deploying protective shields upon anyone it touches."
TacticalText="<Bullet/> The Energy Shield Grenade can provide a 3HP shield to anyone that it explodes upon.\m<Bullet\> The Enery Shield will expire either after 6 turns or after absorbing the full 3 damage.\n"
ThrownAbilityName="Throw Energy Shield Grenade"
ThrownAbilityHelpText="Deploys a protective energy shield on ANY unit in its blast radius."
LaunchedAbilityname="Launch Energy Shield Grenade"
LaunchedAbilityHelpText="Deploys a protective energy shield on ANY unit in its blast radius."
[XES_EnergyShieldPersonalTech X2TechTemplate]
DisplayName="Personal Energy Shield Generator"
Summary="Having seen the Advent Shieldbearers create energy shields for themselves, we believe that it may be possible to utilize this ability ourselves to create personal energy shields that single operatives can wield in the field."
CodeName="Proto"
LongDescript="Although our elerium and time is quite precious, we believe that by allocating a small amount of it to the development of personal energy shields we can greatly improve our soldier's longevity in the fields. By using elerium's immense energy stores and the elerium core as a conduit, we should be able to emulate the Advent Shieldbearer's energy shield for use by our own soliders. The Personal Shield Generator should create a protective shield around one of our soldiers that absorbs damage before being destroyed."
[XES_EnergyShieldGroupTech X2TechTemplate]
DisplayName="Group Energy Shield Generator"
Summary="Having seen the Advent Shieldbearers create energy shields for themselves, we believe that it may be possible to utilize this ability ourselves to create group energy shield devices that our operatives can wield in the field to deploy energy shields over the entire squad."
CodeName="Proto"
LongDescript="Although our elerium and time is quite precious, we believe that by allocating a small amount of it to the development of group energy shields we can greatly improve all of our soldier's longevity in the fields. By using elerium's immense energy stores and the elerium core as a conduit, we should be able to emulate the Advent Shieldbearer's energy shield for use by our own soliders. The Group Shield Generator should create a protective shield around a group of our soldiers that absorbs damage before being destroyed."